static const unsigned char roll_righttoleft[]={ /* Двигаем бит 0 с права на лево */
                        254, //- 0b11111110
                        253, //- 0b11111101
                        251, //- 0b11111011
                        247, //- 0b11110111
                        239, //- 0b11101111
						223, //- 0b11011111
						191, //- 0b10111111
						127  //- 0b01111111
						};
static const unsigned char roll_lefttoright[]={ /* Двигаем бит 0 с лева на право */ 
						127, //- 0b01111111
						191, //- 0b10111111
						223, //- 0b11011111
						239, //- 0b11101111
						247, //- 0b11110111
						251, //- 0b11111011
						253, //- 0b11111101
						254  //- 0b11111110
					   	};
static const unsigned char fill_righttoleft[]={ /* Заполняем битом 0 с права на лево */
						254, //- 0b11111110
						252, //- 0b11111100
						248, //- 0b11111000
						240, //- 0b11110000
						224, //- 0b11100000
						192, //- 0b11000000
						128, //- 0b10000000
						0    //- 0b00000000
						};
static const unsigned char fill_lefttoright[]={ /* Заполняем битом 0 с лева на право */
						127, //- 0b01111111
						63,  //- 0b00111111
						31,  //- 0b00011111
						15,  //- 0b00001111
						7,   //- 0b00000111
						3,   //- 0b00000011
						1,   //- 0b00000001
						0    //- 0b00000000
					   	};
static const unsigned char empty_lefttoright[]={ /* Очищаем бит 0 с лева на право */
						128, //- 0b10000000
						192, //- 0b11000000
						224, //- 0b11100000
						240, //- 0b11110000
						248, //- 0b11111000
						252, //- 0b11111100
						254, //- 0b11111110
						255  //- 0b11111111
					   	};
static const unsigned char empty_righttoleft[]={ /* Очищаем бит 0 с права на лево */
						1,   //- 0b00000001
						3,   //- 0b00000011
						7,   //- 0b00000111
						15,  //- 0b00001111
						31,  //- 0b00011111
						63,  //- 0b00111111
						127, //- 0b01111111
						255  //- 0b11111111
					   	};



enum rollupmode {
    LTOR    = 1,
    RTOL    = 2,
    FRTOL   = 3,
    FLTOR   = 4,
    ERTOL   = 5,
    ELTOR   = 6
 };

/* Возваращает необходимый байт в зависимости от выбранного режима номера по порядку */
unsigned char	rollupzerobit(int i, enum rollupmode mode);

/* Возвращает строку содержащую бинарный вид передаваемого значения */
char            *format_binary(unsigned int x);                                                                                   
